{
    "experience": [
      {
        "id": 1,
        "title": "Software Developer | Freelance",
        "company": "Lethbridge, AB",
        "dates": "SEP 2023 - Present",
        "role": "Remote",
        "responsibilities": [
          "Designed, Developed and maintained a website for a client working with people with special needs.",
          "Designed a wireframe and prototype using Figma design tool while communicating with the client to gather requirements.",
          "Developed, deployed and maintained a fully responsive, engaging and interactive website for clients using React with TypeScript, SASS and GSAP animation library leading to 100% online presence and engagement."
        ]
      },
      {
        "id": 2,
        "title": "Software Developer",
        "company": "BIPOC Foundation - Lethbridge, AB",
        "dates": "SEP 2023 - Present",
        "role": "Hybrid, Volunteer",
        "responsibilities": [
          "Collaborated with the team on project planning and requirements gathering using JIRA.",
          "Designed a wireframe and prototype using Figma design tool while communicating with the client to gather requirements.",
          "Advised team on system architecture and design.",
          "Reporting on annual management meetings aimed at coordinating events for technology businesses in Lethbridge."
        ]
      },
      {
        "id": 3,
        "title": "Software Developer, T.A",
        "company": "BrainStation - Toronto, ON",
        "dates": "SEP 2023 - DEC 2023",
        "role": "On-Site, Contract Full-Time",
        "responsibilities": [
          "Championed a nurturing environment for 11 junior developers, providing mentorship and effective communication, fostering a culture of innovation and excellence.",
          "Executed code reviews in JavaScript, React, and Express providing feedback that led to a 90% increase in the effectiveness of the developers and application performance.",
          "Supervised the successful development of 10 unique full-stack web applications, an example of which is a real-time multiplayer data structures and algorithms game that was built with React on the front end, and API was built using Express.js and MySQL and Mongo DB was used for the database and RabbitMQ and Socket.io were used for messaging. Docker was used for containerizing the application."
        ]
      },
      {
        "id": 4,
        "title": "Software Developer",
        "company": "AAJIMATICS Incorporated - Hamilton, ON",
        "dates": "Nov 2022 – Jun 2023",
        "role": "Remote, Contract Full-time",
        "responsibilities": [
          "Collaborated with team members to design and build SQL database using MySQL database management system and build APIs and integrate third-party APIs on e-health product using Express.js and spring boot working with Docker and Kubernetes clusters.",
          "Developed an in-house full-stack client management system on Node.js, Express.js, and React.js using TypeScript, and implemented state management using Redux that led to a 10% boost in productivity.",
          "Collaborating with the team to maintain code bases on GitHub, performing code reviews on pull requests. Effectively planning project sprints on JIRA, and working with agile scrum methodologies."
        ]
      },
      {
        "id": 5,
        "title": "Software Engineer",
        "company": "BELDORE Technologies - Lagos, NG",
        "dates": "Apr 2022 – Nov 2022",
        "role": "Hybrid",
        "responsibilities": [
          "Developed and maintained responsive websites, using the power of React Hooks to create dynamic and reusable components on React.js, consistently meeting design specifications and accessibility standards for 2 satisfied clients.",
          "Collaborated with a team of 2 frontend developers and a Developer lead in building reusable frontend components for a vacation booking application on React and maintaining versions of the application on GitHub."
        ]
      },
      {
        "id": 6,
        "title": "Software Developer",
        "company": "Freelance - Lagos, NG",
        "dates": "Jul 2018 – Apr 2022",
        "role": "Remote",
        "responsibilities": [
          "Designed and Developed responsive website for clients.",
          "Developed engaging, responsive and professional websites for clients demonstrating a strong understanding of WordPress, HTML, CSS, and JavaScript.",
          "Built a website for a book cover design company."
        ]
      }
    ]
  }
  